12-fvm-convection-in-OpenFOAM/case_1D_simple_convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    leftBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       99;
    }
    rightBoundary
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       100;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          400;
        startFace       101;
    }
)

// ************************************************************************* //
